# Задание 2: Функция с возвращаемым значением
# Напишите функцию add(a, b), которая принимает два числа и возвращает их сумму.
# Пример вызова:

# result = add(3, 5)
# print(result)  # Вывод: 8

def add(a, b):
    return a + b

result = add(10, 5)
print(result) 

# ✅ Параметры (a, b) – это переменные внутри функции.
# ✅ Аргументы (10, 5) – это конкретные значения, переданные в функцию.
# ✅ return нужен, чтобы функция возвращала результат