# Задание 1: Определение функции
# Напишите функцию greet(name), которая принимает одно имя в качестве аргумента и выводит приветственное сообщение, например: "Привет, [имя]!".
# Пример вызова:
# greet("Аня")  # Вывод: Привет, Аня!

def greet(name):
    print(f"Привет, {name}!")
    
greet("Аня")  # Вывод: Привет, Аня!
greet("Нона")