# Задание 5: Функция со списком
# Напишите функцию sum_of_list(numbers), которая принимает список чисел и возвращает их сумму

def sum_of_list(numbers):
    return sum(numbers) 

numbers = [1, 2, 3, 4, 5]
print(sum_of_list(numbers)) 
